// Шта су низови?
// Низови су само специјална врста објекта

let x1 = 4
let x2 = 5
let x3 = 7

let nizBrojeva = [4,5,7,3,5,86,59,95,522,[545,655,777,888,999,110],'sdfsd'] // бројање унутар низа почињемо од 0,1,2..
console.log(typeof nizBrojeva)

console.log("Други конзол")
console.log(nizBrojeva)


// Како приступамо елементима низа?

console.log("Други конзол")
console.log(nizBrojeva[9][0])

// console.log(nizBrojeva[0])
// console.log(nizBrojeva[1])
// console.log(nizBrojeva[2])


// Како итерирамо (пролазимо) кроз низ?

console.log(nizBrojeva.length) // приказаће само један број односно колико има ствари у низу
// А како ћемо добити да нам испише све чланове низа појединачно а да не куцамо сваки понаособ као у коментару изнад, па наравно идемо у петљу где ћемо искористити после имена низа функцију .lenght , где добијемо коначан број који убацимо као користан број колико ће се петља понављати.

for(let i = 0; i < nizBrojeva.length; i++){
    console.log(i, nizBrojeva[i])
}

// Како прослеђујемо низ функцији?






console.log(`БРАВО ПРЕДРАЖЕ ЗА ОВО ВЕЖБАЊЕ!!!`)